In [15]:
import numpy as np

In [14]:
import pandas as pd

In [3]:
import functools

In [4]:
outside = ['G1','G1','G1','G2','G2','G2']

In [5]:
inside = [1,2,3,1,2,3]

In [6]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [7]:
inside

[1, 2, 3, 1, 2, 3]

In [9]:
zip(outside,inside)

In [12]:
hier_index=list(zip(outside,inside))

In [13]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [18]:
h_new=pd.MultiIndex.from_tuples(hier_index)

In [21]:
h_new

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [17]:
np.random.randn(6,2)

array([[ 0.28163922,  1.68042067],
       [ 1.74734696,  0.68260913],
       [-1.83984899, -0.23967907],
       [-1.12947   ,  0.07107292],
       [-1.37332688,  0.25479855],
       [-0.49248693, -0.68618781]])

In [19]:
df = pd.DataFrame(np.random.randn(6,2),index=h_new,columns=['A','B'])

In [20]:
df

             A         B
G1 1  1.051519  0.240799
   2 -0.903368 -0.714296
   3  1.191431  0.898761
G2 1 -0.798263 -0.013166
   2  0.087477 -2.524800
   3  0.773222  0.351590

In [23]:
df.loc['G1']

          A         B
1  1.051519  0.240799
2 -0.903368 -0.714296
3  1.191431  0.898761

In [29]:
type(df.loc['G2'])

pandas.core.frame.DataFrame

In [32]:
df.loc['G2'].loc[2]

A    0.087477
B   -2.524800
Name: 2, dtype: float64

In [34]:
df.index.names

FrozenList([None, None])

In [35]:
df.index.names = ['Group','Num']

In [36]:
df

                  A         B
Group Num
G1    1    1.051519  0.240799
      2   -0.903368 -0.714296
      3    1.191431  0.898761
G2    1   -0.798263 -0.013166
      2    0.087477 -2.524800
      3    0.773222  0.351590

In [37]:
df.xs('G2')

            A         B
Num
1   -0.798263 -0.013166
2    0.087477 -2.524800
3    0.773222  0.351590

In [40]:
df.xs(['G1',2])

A   -0.903368
B   -0.714296
Name: (G1, 2), dtype: float64

In [41]:
df.xs(1,level='Num')

              A         B
Group
G1     1.051519  0.240799
G2    -0.798263 -0.013166

In [42]:
np.nan

nan

In [43]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [44]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
np.nan

nan

In [46]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [47]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [48]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [55]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [53]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [50]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [51]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [52]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [56]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [57]:
df.dropna(thresh=5)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [59]:
df.fillna('dfgdgdsagdsg')

              A             B  C
0             1             5  1
1             2  dfgdgdsagdsg  2
2  dfgdgdsagdsg  dfgdgdsagdsg  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

In [60]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [61]:
df['A'].mean()

1.5

In [62]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [63]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [64]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [65]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [66]:
df = pd.DataFrame(data)

In [67]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [69]:
by_company=df.groupby('Company')

In [70]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [71]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [72]:
by_company.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [73]:
by_company.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [74]:
by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [75]:
by_company.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [76]:
by_company.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [78]:
by_company.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64